# Transform2D Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Transform2D Constructor
Transform2D Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Transform2D(Transform2D) | The copy constructor. |
| Transform2D(UV, UV, UV) | Constructs the transformation by specifying the vectors and the origin. |

# See Also
Transform2D Class
Transform2D Members
Autodesk.Revit.DB Namespace